MinhDinhTran/STM32Bootloader/bootloader_STM32F1xx/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
#define B1_Pin GPIO_PIN_8
#define B1_GPIO_Port GPIOA
#define FLASH_SECTOR2_BASE_ADDRESS 0x08008000U
  /* USER CODE END EC */

  /* Exported macro ------------------------------------------------------------*/
  /* USER CODE BEGIN EM */

  /* USER CODE END EM */

  /* Exported functions prototypes ---------------------------------------------*/
  void Error_Handler(void);

  /* USER CODE BEGIN EFP */
  /*Bootloader function prototypes */

  void bootloader_uart_read_data(void);
  void bootloader_jump_to_user_app(void);

  void bootloader_handle_getver_cmd(uint8_t *bl_rx_buffer);
  void bootloader_handle_gethelp_cmd(uint8_t *pBuffer);
  void bootloader_handle_getcid_cmd(uint8_t *pBuffer);
  void bootloader_handle_getrdp_cmd(uint8_t *pBuffer);
  void bootloader_handle_go_cmd(uint8_t *pBuffer);
  void bootloader_handle_flash_erase_cmd(uint8_t *pBuffer);
  void bootloader_handle_mem_write_cmd(uint8_t *pBuffer);
  void bootloader_handle_en_rw_protect(uint8_t *pBuffer);
  void bootloader_handle_mem_read(uint8_t *pBuffer);
  void bootloader_handle_read_sector_protection_status(uint8_t *pBuffer);
  void bootloader_handle_read_otp(uint8_t *pBuffer);
  void bootloader_handle_dis_rw_protect(uint8_t *pBuffer);

  void bootloader_send_ack(uint8_t command_code, uint8_t follow_len);
  void bootloader_send_nack(void);

  uint8_t bootloader_verify_crc(uint8_t *pData, uint32_t len, uint32_t crc_host);
  uint8_t get_bootloader_version(void);
  void bootloader_uart_write_data(uint8_t *pBuffer, uint32_t len);

  uint16_t get_mcu_chip_id(void);
  uint8_t get_flash_rdp_level(void);
  uint8_t verify_address(uint32_t go_address);
  uint8_t execute_flash_erase(uint8_t sector_number, uint8_t number_of_sector);
  uint8_t execute_mem_write(uint8_t *pBuffer, uint32_t mem_address, uint32_t len);

  uint8_t configure_flash_sector_rw_protection(uint8_t sector_details, uint8_t protection_mode, uint8_t disable);

  uint16_t read_OB_rw_protection_status(void);

//version 1.0
#define BL_VERSION 0x10

// our bootloader commands

//#define  <command name >	<command_code>

//This command is used to read the bootloader version from the MCU
#define BL_GET_VER 0x51

//This command is used to know what are the commands supported by the bootloader
#define BL_GET_HELP 0x52

//This command is used to read the MCU chip identification number
#define BL_GET_CID 0x53

//This command is used to read the FLASH Read Protection level.
#define BL_GET_RDP_STATUS 0x54

//This command is used to jump bootloader to specified address.
#define BL_GO_TO_ADDR 0x55

//This command is used to mass erase or sector erase of the user flash .
#define BL_FLASH_ERASE 0x56

//This command is used to write data in to different memories of the MCU
#define BL_MEM_WRITE 0x57

//This command is used to enable or disable read/write protect on different sectors of the user flash .
#define BL_EN_RW_PROTECT 0x58

//This command is used to read data from different memories of the microcontroller.
#define BL_MEM_READ 0x59

//This command is used to read all the sector protection status.
#define BL_READ_SECTOR_P_STATUS 0x5A

//This command is used to read the OTP contents.
#define BL_OTP_READ 0x5B

//This command is used disable all sector read/write protection
#define BL_DIS_R_W_PROTECT 0x5C

/* ACK and NACK bytes*/
#define BL_ACK 0XA5
#define BL_NACK 0X7F

/*CRC*/
#define VERIFY_CRC_FAIL 1
#define VERIFY_CRC_SUCCESS 0

#define ADDR_VALID 0x00
#define ADDR_INVALID 0x01

#define INVALID_SECTOR 0x04

/*Some Start and End addresses of different memories of STM32F446xx MCU */
/*Change this according to your MCU */
#define SRAM1_SIZE 112 * 1024 // STM32F446RE has 112KB of SRAM1
#define SRAM1_END (SRAM1_BASE + SRAM1_SIZE)
#define SRAM2_SIZE 16 * 1024 // STM32F446RE has 16KB of SRAM2
#define SRAM2_END (SRAM2_BASE + SRAM2_SIZE)
#define FLASH_SIZE 512 * 1024 // STM32F446RE has 512KB of SRAM2
#define BKPSRAM_SIZE 4 * 1024 // STM32F446RE has 4KB of SRAM2
#define BKPSRAM_END (BKPSRAM_BASE + BKPSRAM_SIZE)
  /* USER CODE END EFP */

  /* Private defines -----------------------------------------------------------*/
  /* USER CODE BEGIN Private defines */

  /* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
